GopalSaraf/Practicals/PSDL/include/proc/pic18f4685.inc
// Register: RXF14SIDL
#define RXF14SIDL RXF14SIDL
RXF14SIDL                                equ 0D89h
// bitfield definitions
RXF14SIDL_EID16_POSN                     equ 0000h
RXF14SIDL_EID16_POSITION                 equ 0000h
RXF14SIDL_EID16_SIZE                     equ 0001h
RXF14SIDL_EID16_LENGTH                   equ 0001h
RXF14SIDL_EID16_MASK                     equ 0001h
RXF14SIDL_EID17_POSN                     equ 0001h
RXF14SIDL_EID17_POSITION                 equ 0001h
RXF14SIDL_EID17_SIZE                     equ 0001h
RXF14SIDL_EID17_LENGTH                   equ 0001h
RXF14SIDL_EID17_MASK                     equ 0002h
RXF14SIDL_EXIDEN_POSN                    equ 0003h
RXF14SIDL_EXIDEN_POSITION                equ 0003h
RXF14SIDL_EXIDEN_SIZE                    equ 0001h
RXF14SIDL_EXIDEN_LENGTH                  equ 0001h
RXF14SIDL_EXIDEN_MASK                    equ 0008h
RXF14SIDL_SID0_POSN                      equ 0005h
RXF14SIDL_SID0_POSITION                  equ 0005h
RXF14SIDL_SID0_SIZE                      equ 0001h
RXF14SIDL_SID0_LENGTH                    equ 0001h
RXF14SIDL_SID0_MASK                      equ 0020h
RXF14SIDL_SID1_POSN                      equ 0006h
RXF14SIDL_SID1_POSITION                  equ 0006h
RXF14SIDL_SID1_SIZE                      equ 0001h
RXF14SIDL_SID1_LENGTH                    equ 0001h
RXF14SIDL_SID1_MASK                      equ 0040h
RXF14SIDL_SID2_POSN                      equ 0007h
RXF14SIDL_SID2_POSITION                  equ 0007h
RXF14SIDL_SID2_SIZE                      equ 0001h
RXF14SIDL_SID2_LENGTH                    equ 0001h
RXF14SIDL_SID2_MASK                      equ 0080h
RXF14SIDL_EXIDE_POSN                     equ 0003h
RXF14SIDL_EXIDE_POSITION                 equ 0003h
RXF14SIDL_EXIDE_SIZE                     equ 0001h
RXF14SIDL_EXIDE_LENGTH                   equ 0001h
RXF14SIDL_EXIDE_MASK                     equ 0008h
RXF14SIDL_RXF14EID16_POSN                equ 0000h
RXF14SIDL_RXF14EID16_POSITION            equ 0000h
RXF14SIDL_RXF14EID16_SIZE                equ 0001h
RXF14SIDL_RXF14EID16_LENGTH              equ 0001h
RXF14SIDL_RXF14EID16_MASK                equ 0001h
RXF14SIDL_RXF14EID17_POSN                equ 0001h
RXF14SIDL_RXF14EID17_POSITION            equ 0001h
RXF14SIDL_RXF14EID17_SIZE                equ 0001h
RXF14SIDL_RXF14EID17_LENGTH              equ 0001h
RXF14SIDL_RXF14EID17_MASK                equ 0002h
RXF14SIDL_RXF14EXIDEN_POSN               equ 0003h
RXF14SIDL_RXF14EXIDEN_POSITION           equ 0003h
RXF14SIDL_RXF14EXIDEN_SIZE               equ 0001h
RXF14SIDL_RXF14EXIDEN_LENGTH             equ 0001h
RXF14SIDL_RXF14EXIDEN_MASK               equ 0008h
RXF14SIDL_RXF14SID0_POSN                 equ 0005h
RXF14SIDL_RXF14SID0_POSITION             equ 0005h
RXF14SIDL_RXF14SID0_SIZE                 equ 0001h
RXF14SIDL_RXF14SID0_LENGTH               equ 0001h
RXF14SIDL_RXF14SID0_MASK                 equ 0020h
RXF14SIDL_RXF14SID1_POSN                 equ 0006h
RXF14SIDL_RXF14SID1_POSITION             equ 0006h
RXF14SIDL_RXF14SID1_SIZE                 equ 0001h
RXF14SIDL_RXF14SID1_LENGTH               equ 0001h
RXF14SIDL_RXF14SID1_MASK                 equ 0040h
RXF14SIDL_RXF14SID2_POSN                 equ 0007h
RXF14SIDL_RXF14SID2_POSITION             equ 0007h
RXF14SIDL_RXF14SID2_SIZE                 equ 0001h
RXF14SIDL_RXF14SID2_LENGTH               equ 0001h
RXF14SIDL_RXF14SID2_MASK                 equ 0080h

// Register: RXF14EIDH
#define RXF14EIDH RXF14EIDH
RXF14EIDH                                equ 0D8Ah
// bitfield definitions
RXF14EIDH_EID8_POSN                      equ 0000h
RXF14EIDH_EID8_POSITION                  equ 0000h
RXF14EIDH_EID8_SIZE                      equ 0001h
RXF14EIDH_EID8_LENGTH                    equ 0001h
RXF14EIDH_EID8_MASK                      equ 0001h
RXF14EIDH_EID9_POSN                      equ 0001h
RXF14EIDH_EID9_POSITION                  equ 0001h
RXF14EIDH_EID9_SIZE                      equ 0001h
RXF14EIDH_EID9_LENGTH                    equ 0001h
RXF14EIDH_EID9_MASK                      equ 0002h
RXF14EIDH_EID10_POSN                     equ 0002h
RXF14EIDH_EID10_POSITION                 equ 0002h
RXF14EIDH_EID10_SIZE                     equ 0001h
RXF14EIDH_EID10_LENGTH                   equ 0001h
RXF14EIDH_EID10_MASK                     equ 0004h
RXF14EIDH_EID11_POSN                     equ 0003h
RXF14EIDH_EID11_POSITION                 equ 0003h
RXF14EIDH_EID11_SIZE                     equ 0001h
RXF14EIDH_EID11_LENGTH                   equ 0001h
RXF14EIDH_EID11_MASK                     equ 0008h
RXF14EIDH_EID12_POSN                     equ 0004h
RXF14EIDH_EID12_POSITION                 equ 0004h
RXF14EIDH_EID12_SIZE                     equ 0001h
RXF14EIDH_EID12_LENGTH                   equ 0001h
RXF14EIDH_EID12_MASK                     equ 0010h
RXF14EIDH_EID13_POSN                     equ 0005h
RXF14EIDH_EID13_POSITION                 equ 0005h
RXF14EIDH_EID13_SIZE                     equ 0001h
RXF14EIDH_EID13_LENGTH                   equ 0001h
RXF14EIDH_EID13_MASK                     equ 0020h
RXF14EIDH_EID14_POSN                     equ 0006h
RXF14EIDH_EID14_POSITION                 equ 0006h
RXF14EIDH_EID14_SIZE                     equ 0001h
RXF14EIDH_EID14_LENGTH                   equ 0001h
RXF14EIDH_EID14_MASK                     equ 0040h
RXF14EIDH_EID15_POSN                     equ 0007h
RXF14EIDH_EID15_POSITION                 equ 0007h
RXF14EIDH_EID15_SIZE                     equ 0001h
RXF14EIDH_EID15_LENGTH                   equ 0001h
RXF14EIDH_EID15_MASK                     equ 0080h
RXF14EIDH_RXF14EID8_POSN                 equ 0000h
RXF14EIDH_RXF14EID8_POSITION             equ 0000h
RXF14EIDH_RXF14EID8_SIZE                 equ 0001h
RXF14EIDH_RXF14EID8_LENGTH               equ 0001h
RXF14EIDH_RXF14EID8_MASK                 equ 0001h
RXF14EIDH_RXF14EID9_POSN                 equ 0001h
RXF14EIDH_RXF14EID9_POSITION             equ 0001h
RXF14EIDH_RXF14EID9_SIZE                 equ 0001h
RXF14EIDH_RXF14EID9_LENGTH               equ 0001h
RXF14EIDH_RXF14EID9_MASK                 equ 0002h
RXF14EIDH_RXF14EID10_POSN                equ 0002h
RXF14EIDH_RXF14EID10_POSITION            equ 0002h
RXF14EIDH_RXF14EID10_SIZE                equ 0001h
RXF14EIDH_RXF14EID10_LENGTH              equ 0001h
RXF14EIDH_RXF14EID10_MASK                equ 0004h
RXF14EIDH_RXF14EID11_POSN                equ 0003h
RXF14EIDH_RXF14EID11_POSITION            equ 0003h
RXF14EIDH_RXF14EID11_SIZE                equ 0001h
RXF14EIDH_RXF14EID11_LENGTH              equ 0001h
RXF14EIDH_RXF14EID11_MASK                equ 0008h
RXF14EIDH_RXF14EID12_POSN                equ 0004h
RXF14EIDH_RXF14EID12_POSITION            equ 0004h
RXF14EIDH_RXF14EID12_SIZE                equ 0001h
RXF14EIDH_RXF14EID12_LENGTH              equ 0001h
RXF14EIDH_RXF14EID12_MASK                equ 0010h
RXF14EIDH_RXF14EID13_POSN                equ 0005h
RXF14EIDH_RXF14EID13_POSITION            equ 0005h
RXF14EIDH_RXF14EID13_SIZE                equ 0001h
RXF14EIDH_RXF14EID13_LENGTH              equ 0001h
RXF14EIDH_RXF14EID13_MASK                equ 0020h
RXF14EIDH_RXF14EID14_POSN                equ 0006h
RXF14EIDH_RXF14EID14_POSITION            equ 0006h
RXF14EIDH_RXF14EID14_SIZE                equ 0001h
RXF14EIDH_RXF14EID14_LENGTH              equ 0001h
RXF14EIDH_RXF14EID14_MASK                equ 0040h
RXF14EIDH_RXF14EID15_POSN                equ 0007h
RXF14EIDH_RXF14EID15_POSITION            equ 0007h
RXF14EIDH_RXF14EID15_SIZE                equ 0001h
RXF14EIDH_RXF14EID15_LENGTH              equ 0001h
RXF14EIDH_RXF14EID15_MASK                equ 0080h

// Register: RXF14EIDL
#define RXF14EIDL RXF14EIDL
RXF14EIDL                                equ 0D8Bh
// bitfield definitions
RXF14EIDL_EID0_POSN                      equ 0000h
RXF14EIDL_EID0_POSITION                  equ 0000h
RXF14EIDL_EID0_SIZE                      equ 0001h
RXF14EIDL_EID0_LENGTH                    equ 0001h
RXF14EIDL_EID0_MASK                      equ 0001h
RXF14EIDL_EID1_POSN                      equ 0001h
RXF14EIDL_EID1_POSITION                  equ 0001h
RXF14EIDL_EID1_SIZE                      equ 0001h
RXF14EIDL_EID1_LENGTH                    equ 0001h
RXF14EIDL_EID1_MASK                      equ 0002h
RXF14EIDL_EID2_POSN                      equ 0002h
RXF14EIDL_EID2_POSITION                  equ 0002h
RXF14EIDL_EID2_SIZE                      equ 0001h
RXF14EIDL_EID2_LENGTH                    equ 0001h
RXF14EIDL_EID2_MASK                      equ 0004h
RXF14EIDL_EID3_POSN                      equ 0003h
RXF14EIDL_EID3_POSITION                  equ 0003h
RXF14EIDL_EID3_SIZE                      equ 0001h
RXF14EIDL_EID3_LENGTH                    equ 0001h
RXF14EIDL_EID3_MASK                      equ 0008h
RXF14EIDL_EID4_POSN                      equ 0004h
RXF14EIDL_EID4_POSITION                  equ 0004h
RXF14EIDL_EID4_SIZE                      equ 0001h
RXF14EIDL_EID4_LENGTH                    equ 0001h
RXF14EIDL_EID4_MASK                      equ 0010h
RXF14EIDL_EID5_POSN                      equ 0005h
RXF14EIDL_EID5_POSITION                  equ 0005h
RXF14EIDL_EID5_SIZE                      equ 0001h
RXF14EIDL_EID5_LENGTH                    equ 0001h
RXF14EIDL_EID5_MASK                      equ 0020h
RXF14EIDL_EID6_POSN                      equ 0006h
RXF14EIDL_EID6_POSITION                  equ 0006h
RXF14EIDL_EID6_SIZE                      equ 0001h
RXF14EIDL_EID6_LENGTH                    equ 0001h
RXF14EIDL_EID6_MASK                      equ 0040h
RXF14EIDL_EID7_POSN                      equ 0007h
RXF14EIDL_EID7_POSITION                  equ 0007h
RXF14EIDL_EID7_SIZE                      equ 0001h
RXF14EIDL_EID7_LENGTH                    equ 0001h
RXF14EIDL_EID7_MASK                      equ 0080h
RXF14EIDL_RXF14EID0_POSN                 equ 0000h
RXF14EIDL_RXF14EID0_POSITION             equ 0000h
RXF14EIDL_RXF14EID0_SIZE                 equ 0001h
RXF14EIDL_RXF14EID0_LENGTH               equ 0001h
RXF14EIDL_RXF14EID0_MASK                 equ 0001h
RXF14EIDL_RXF14EID1_POSN                 equ 0001h
RXF14EIDL_RXF14EID1_POSITION             equ 0001h
RXF14EIDL_RXF14EID1_SIZE                 equ 0001h
RXF14EIDL_RXF14EID1_LENGTH               equ 0001h
RXF14EIDL_RXF14EID1_MASK                 equ 0002h
RXF14EIDL_RXF14EID2_POSN                 equ 0002h
RXF14EIDL_RXF14EID2_POSITION             equ 0002h
RXF14EIDL_RXF14EID2_SIZE                 equ 0001h
RXF14EIDL_RXF14EID2_LENGTH               equ 0001h
RXF14EIDL_RXF14EID2_MASK                 equ 0004h
RXF14EIDL_RXF14EID3_POSN                 equ 0003h
RXF14EIDL_RXF14EID3_POSITION             equ 0003h
RXF14EIDL_RXF14EID3_SIZE                 equ 0001h
RXF14EIDL_RXF14EID3_LENGTH               equ 0001h
RXF14EIDL_RXF14EID3_MASK                 equ 0008h
RXF14EIDL_RXF14EID4_POSN                 equ 0004h
RXF14EIDL_RXF14EID4_POSITION             equ 0004h
RXF14EIDL_RXF14EID4_SIZE                 equ 0001h
RXF14EIDL_RXF14EID4_LENGTH               equ 0001h
RXF14EIDL_RXF14EID4_MASK                 equ 0010h
RXF14EIDL_RXF14EID5_POSN                 equ 0005h
RXF14EIDL_RXF14EID5_POSITION             equ 0005h
RXF14EIDL_RXF14EID5_SIZE                 equ 0001h
RXF14EIDL_RXF14EID5_LENGTH               equ 0001h
RXF14EIDL_RXF14EID5_MASK                 equ 0020h
RXF14EIDL_RXF14EID6_POSN                 equ 0006h
RXF14EIDL_RXF14EID6_POSITION             equ 0006h
RXF14EIDL_RXF14EID6_SIZE                 equ 0001h
RXF14EIDL_RXF14EID6_LENGTH               equ 0001h
RXF14EIDL_RXF14EID6_MASK                 equ 0040h
RXF14EIDL_RXF14EID7_POSN                 equ 0007h
RXF14EIDL_RXF14EID7_POSITION             equ 0007h
RXF14EIDL_RXF14EID7_SIZE                 equ 0001h
RXF14EIDL_RXF14EID7_LENGTH               equ 0001h
RXF14EIDL_RXF14EID7_MASK                 equ 0080h

// Register: RXF15SIDH
#define RXF15SIDH RXF15SIDH
RXF15SIDH                                equ 0D90h
// bitfield definitions
RXF15SIDH_SID3_POSN                      equ 0000h
RXF15SIDH_SID3_POSITION                  equ 0000h
RXF15SIDH_SID3_SIZE                      equ 0001h
RXF15SIDH_SID3_LENGTH                    equ 0001h
RXF15SIDH_SID3_MASK                      equ 0001h
RXF15SIDH_SID4_POSN                      equ 0001h
RXF15SIDH_SID4_POSITION                  equ 0001h
RXF15SIDH_SID4_SIZE                      equ 0001h
RXF15SIDH_SID4_LENGTH                    equ 0001h
RXF15SIDH_SID4_MASK                      equ 0002h
RXF15SIDH_SID5_POSN                      equ 0002h
RXF15SIDH_SID5_POSITION                  equ 0002h
RXF15SIDH_SID5_SIZE                      equ 0001h
RXF15SIDH_SID5_LENGTH                    equ 0001h
RXF15SIDH_SID5_MASK                      equ 0004h
RXF15SIDH_SID6_POSN                      equ 0003h
RXF15SIDH_SID6_POSITION                  equ 0003h
RXF15SIDH_SID6_SIZE                      equ 0001h
RXF15SIDH_SID6_LENGTH                    equ 0001h
RXF15SIDH_SID6_MASK                      equ 0008h
RXF15SIDH_SID7_POSN                      equ 0004h
RXF15SIDH_SID7_POSITION                  equ 0004h
RXF15SIDH_SID7_SIZE                      equ 0001h
RXF15SIDH_SID7_LENGTH                    equ 0001h
RXF15SIDH_SID7_MASK                      equ 0010h
RXF15SIDH_SID8_POSN                      equ 0005h
RXF15SIDH_SID8_POSITION                  equ 0005h
RXF15SIDH_SID8_SIZE                      equ 0001h
RXF15SIDH_SID8_LENGTH                    equ 0001h
RXF15SIDH_SID8_MASK                      equ 0020h
RXF15SIDH_SID9_POSN                      equ 0006h
RXF15SIDH_SID9_POSITION                  equ 0006h
RXF15SIDH_SID9_SIZE                      equ 0001h
RXF15SIDH_SID9_LENGTH                    equ 0001h
RXF15SIDH_SID9_MASK                      equ 0040h
RXF15SIDH_SID10_POSN                     equ 0007h
RXF15SIDH_SID10_POSITION                 equ 0007h
RXF15SIDH_SID10_SIZE                     equ 0001h
RXF15SIDH_SID10_LENGTH                   equ 0001h
RXF15SIDH_SID10_MASK                     equ 0080h
RXF15SIDH_RXF15SID3_POSN                 equ 0000h
RXF15SIDH_RXF15SID3_POSITION             equ 0000h
RXF15SIDH_RXF15SID3_SIZE                 equ 0001h
RXF15SIDH_RXF15SID3_LENGTH               equ 0001h
RXF15SIDH_RXF15SID3_MASK                 equ 0001h
RXF15SIDH_RXF15SID4_POSN                 equ 0001h
RXF15SIDH_RXF15SID4_POSITION             equ 0001h
RXF15SIDH_RXF15SID4_SIZE                 equ 0001h
RXF15SIDH_RXF15SID4_LENGTH               equ 0001h
RXF15SIDH_RXF15SID4_MASK                 equ 0002h
RXF15SIDH_RXF15SID5_POSN                 equ 0002h
RXF15SIDH_RXF15SID5_POSITION             equ 0002h
RXF15SIDH_RXF15SID5_SIZE                 equ 0001h
RXF15SIDH_RXF15SID5_LENGTH               equ 0001h
RXF15SIDH_RXF15SID5_MASK                 equ 0004h
RXF15SIDH_RXF15SID6_POSN                 equ 0003h
RXF15SIDH_RXF15SID6_POSITION             equ 0003h
RXF15SIDH_RXF15SID6_SIZE                 equ 0001h
RXF15SIDH_RXF15SID6_LENGTH               equ 0001h
RXF15SIDH_RXF15SID6_MASK                 equ 0008h
RXF15SIDH_RXF15SID7_POSN                 equ 0004h
RXF15SIDH_RXF15SID7_POSITION             equ 0004h
RXF15SIDH_RXF15SID7_SIZE                 equ 0001h
RXF15SIDH_RXF15SID7_LENGTH               equ 0001h
RXF15SIDH_RXF15SID7_MASK                 equ 0010h
RXF15SIDH_RXF15SID8_POSN                 equ 0005h
RXF15SIDH_RXF15SID8_POSITION             equ 0005h
RXF15SIDH_RXF15SID8_SIZE                 equ 0001h
RXF15SIDH_RXF15SID8_LENGTH               equ 0001h
RXF15SIDH_RXF15SID8_MASK                 equ 0020h
RXF15SIDH_RXF15SID9_POSN                 equ 0006h
RXF15SIDH_RXF15SID9_POSITION             equ 0006h
RXF15SIDH_RXF15SID9_SIZE                 equ 0001h
RXF15SIDH_RXF15SID9_LENGTH               equ 0001h
RXF15SIDH_RXF15SID9_MASK                 equ 0040h
RXF15SIDH_RXF15SID10_POSN                equ 0007h
RXF15SIDH_RXF15SID10_POSITION            equ 0007h
RXF15SIDH_RXF15SID10_SIZE                equ 0001h
RXF15SIDH_RXF15SID10_LENGTH              equ 0001h
RXF15SIDH_RXF15SID10_MASK                equ 0080h

